package com.brickfarm.dao.memberAddressBook;

import java.util.List;

import com.brickfarm.dto.user.syt.UserAddressBookDTO;
import com.brickfarm.vo.user.psj.UserAddressBookVO;
import com.brickfarm.vo.user.syt.UserAddressVO;

public interface MemberAddressBookDAO {

	// ==[송지영]==========================================================================================================================================
	// ==================================================================================================================================================

	// ==[김미형]==========================================================================================================================================
	// ==================================================================================================================================================

	// ==[이경민]==========================================================================================================================================
	// ==================================================================================================================================================

	// ==[염세환]==========================================================================================================================================
	// ==================================================================================================================================================

	// ==[박상진]==========================================================================================================================================
	// 배송지 전체 목록 조회
	List<UserAddressBookVO> selectAllAdressBook(int memberNo) throws Exception;

	// 기본 배송지 조회
	UserAddressBookVO selectDefaultAddressBook(int member_no) throws Exception;

	// 기본 배송지 상태 해제
	int updateDefaultAddress(int addressBookNo) throws Exception;

	// 배송지 중 기존의 기본 배송지가 있는지 조회
	int selectDefaultAddress(int memberNo) throws Exception;

	// 배송지 추가
	int insertAddressBook(UserAddressBookVO userAdressBookVO) throws Exception;

	int updateAddressBook(UserAddressBookVO addressBookVO) throws Exception;

	List<String> selectAddressBookNameList(int member_no);

	int deleteAddressBook(int addressBookNo);

	UserAddressBookVO selectAddressInfo(int memberAddressBookNo) throws Exception;
	// ==================================================================================================================================================

	// ==[송영태]==========================================================================================================================================
	// 배송지 테이블
	List<UserAddressVO> selectAddressBook(int member_no) throws Exception;
	// 배송지테이블 추가
	int insertAddressBookByOrderPage(UserAddressBookDTO addressBook) throws Exception;
	// ==================================================================================================================================================

	// ==[김용진]==========================================================================================================================================
	// ==================================================================================================================================================
}
